//Задатак 5. На факултету постоjе зависности између испита коjи се полажу. На пример, да би се полагао
//испит “Програмирање 2”, претходно jе неопходно да jе положен испит “Програмирање 1”. Зависности су
//задате матрицом логичких вредности коjа представља jедну релациjу. Напиши програм коjи проверава да ли
//су испуњени следећи услови:
//• релациjа jе антирефлексивна тj. не постоjи ни jедан предмет коjи зависи сам од себе,
//• релациjа jе антисиметрична тj. не постоjе два предмета коjи међусобно зависе jедан од другог,
//• релациjа jе транзитивна тj. ако jедан предмет зависи од другог, а таj други зависи од трећег, онда jе
//неопходно да и први предмет зависи од трећег.

//Улаз: Са стандардног улаза се уноси броj предмета n(5 ≤ n ≤ 10), а затим матрица димензиjе n × n коjа
//садржи само нуле и jединице - jединица у врсти v и колони k означава да предмет са редним броjем v зависи
//од предмета са редним броjем k.

//Излаз: На стандардни излаз исписати DA ако матрица испуњава све задате услове тj. NE ако нарушава било
//коjи од њих.

package TreciDoc;

import java.util.Scanner;

public class Zad05 {
    public static void IspunjeniUsloviFalkultet(int[][] matr, int n) {

    }
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.println("Unesite dimenzije matrice:");
        int n = scanner.nextInt();

        int[][] matr = new int[n][n];

        System.out.println("Unesite elemente matrice:");
        for (int i = 0; i < matr.length; i++) {
            for (int j = 0; j < matr.length; j++) {
                matr[i][j] = scanner.nextInt();
            }
        }

    }
}
