//Задатак 3. На папиру подељеном на n × n jединичних квадратића, нацртано jе неколико правоугаоника
//(паралелно ивицама папира) коjи се не додируjу, осим евентуално jедним теменом. Написати програм коjи
//одређуjе броj правоугаоника на папиру.

//Улаз: У првом реду стандардног улаза дата jе димензиjа табле n ≤ 10, а затим jе у наредним редовима
//задата матрица коjа садржи jединице и нуле, тако да су jединице уписане на местима на коjима су нацртани
//правоугаоници.
//Излаз: На стандардни излаз исписати тражени броj правоугаоника.

package TreciDoc;

public class Zad03 {
    
}
