//Задатак 2. У игрици Minesweeper на пољима се налазе сакривене бомбе и задатак играча jе да их пронађе.
//Играчу се приказуjе табла са броjевима где сваки броj представља броj бомби коjе се налазе у околини датог
//поља (гледаjу се околна поља у свих 8 смерова). Твоj задатак jе да започнеш програмирање ове игре тако
//што ћеш написати програм коjи за дати распоред бомби одређуjе ове броjеве.

//Улаз: Са стандардног улаза се учитаваjу два броjа m и n коjи представљаjу димензиjе табле (3 ≤ m, n ≤ 100) и
//након тога матрица коjа има m врста и n колона коjа садржи нуле и jединице (где jединица означава бомбу).
//Излаз: Матрица димензиjе m × n коjа одређуjе броj бомби у околини сваког поља полазне матрице.

package TreciDoc;

public class Zad02 {
    
}
