//Задатак 6. Са стандардног улаза се уносе степен n и реални коефициjенти полинома y = an · x
//n + an−1 ·
//x
//n−1 +· · ·+a1 ·x+a0. Напиши програм коjи израчунава вредност тог полинома у k равномерно распоређених
//тачака интервала [p, q].

//Улаз: У првоj линиjи стандардног улаза унети n(2 ≤ n ≤ 9) - степен полинома, у следећих n+1 линиjа реалне
//вредности коефициjената полинома (редом броjеви an, an−1, . . . a1, a0), затим, у наредноj линиjи k (2 ≤ k ≤ 40)
//- броj равномерно распоређених тачака на интервалу [p, q], у наредноj линиjи реалну вредност p - почетак
//интервала, и у наредноj линиjи реалну вредност q - краj интервала.
//Излаз: У k линиjа исписати вредност полинома у равномерно распоређеним тачакама интервала [p, q] заокружену на две децимале

package TreciDoc;

public class Zad06 {
    
}
